#include <iostream>
using namespace std;

int main(){
    /*
    数组
    1、定义方式
        数据类型 数组名[ 数组长度 ];
        数据类型 数组名[ 数组长度 ] = { 值1，值2 ...};
        数据类型 数组名[ ] = { 值1，值2 ...};
    2、特点
        放在一块连续的内存中
        数组中的每个元素都是相同类型的
    */
    
    //定义方式1
    //数据类型 数组名[ 数组长度 ];
    int arr1[5];
    
    //利用下标赋值
    arr1[0] = 10;
    arr1[1] = 20;
    arr1[2] = 30;
    arr1[3] = 40;
    arr1[4] = 50;

    //利用下标输出
    for (int i = 0; i < 5; i++)
    {
        cout << arr1[i] << endl;
    }
    
    //定义方式2
    //数据类型 数组名[元素个数] =  {值1，值2 ，值3 ...}
    //如果{}内不足10个数据，剩余数据用0补全
    int arr2[10] = {10, 20, 30, 40, 50};

    //定义方式3
	//数据类型 数组名[] =  {值1，值2 ，值3 ...};
    int arr3[] = {10, 20, 30, 40, 50, 60};
    
    system("pause");
    return 0;
}